### Starter code for Project 4. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [2]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [3]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'vaulted-
dolphin-339503:school_enrollments' already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access/stanford-school-enrollment/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ak.csv

Waiting on bqjob_r19d8a419852a8f33_0000017f4ced710a_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ar.csv

Waiting on bqjob_r3680f7c32e2d9753_0000017f4ced86c2_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.az gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_az.csv

Waiting on bqjob_r41bc7ace402cf16e_0000017f4ceda8d1_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ca.csv

Waiting on bqjob_r50fce006004e7082_0000017f4cedcac4_1 ... (15s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ct.csv

Waiting on bqjob_r28286f4a8ea75199_0000017f4cee1199_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_hi.csv

Waiting on bqjob_r7e29f597cbd99ee4_0000017f4cee2c3a_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.in gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_in.csv

Waiting on bqjob_r1332f4eb83ca9d8c_0000017f4cee416f_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_la.csv

Waiting on bqjob_r535645c40f4cce6b_0000017f4cee5eda_1 ... (4s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_md.csv

Waiting on bqjob_r66855b4d886bd1b_0000017f4cee7c2a_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_mn.csv

Waiting on bqjob_ra275e1eccee081f_0000017f4cee9124_1 ... (5s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ms.csv

Waiting on bqjob_r57a5d5690add7ba7_0000017f4ceeb2aa_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nh.csv

Waiting on bqjob_r66e9eabbcb3f6679_0000017f4ceec83d_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nj gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nj.csv

Waiting on bqjob_r6d3750eb63cde193_0000017f4ceedd29_1 ... (1s) Current status: DONE

BigQuery error in load operation: Error processing job 'vaulted-
dolphin-339503:bqjob_r6d3750eb63cde193_0000017f4ceedd29_1': Error while reading
data, error message: Could not parse 'N' as INT64 for field
ccd_district_high_grade (position 12) starting at location 2800632  with message
'Unable to parse'
Failure details:
- Error while reading data, error message: CSV processing encountered
too many errors, giving up. Rows: 12208; errors: 1; max bad: 0;
error percent: 0
- query: Could not parse 'N' as INT64 for field
ccd_district_high_grade (position 12) starting at location 2800632
with message 'Unable to parse'
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nm gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nm.csv

Waiting on bqjob_r3397f86565f9941_0000017f4ceeed80_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nv.csv

Waiting on bqjob_r255f5c0cdb25903a_0000017f4cef0ab8_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ok.csv

Waiting on bqjob_r1eb70915fe6d67a_0000017f4cef1f47_1 ... (3s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_pa.csv

Waiting on bqjob_r2ee7236349da7bd8_0000017f4cef38a6_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_sc.csv

Waiting on bqjob_r7350b7369c4744fb_0000017f4cef55a4_1 ... (2s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_tx.csv

Waiting on bqjob_r4cecdf813fafa6c5_0000017f4cef6a37_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ut gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ut.csv

Waiting on bqjob_r46bfb097f5bac984_0000017f4cef8b75_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wa.csv

Waiting on bqjob_rd08d2027081b391_0000017f4cef9fcb_1 ... (6s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wy.csv

Waiting on bqjob_r5c3720e3293d9b76_0000017f4cefc5c4_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [6]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1184.50query/s]
Downloading: 100%|██████████| 1739/1739 [00:00<00:00, 1743.38rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [7]:
!bq --location=US mk --dataset "views"

Dataset 'vaulted-dolphin-339503:views' successfully created.

In [8]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1019.02query/s]

Empty DataFrame
Columns: []
Index: []

In [9]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1689.44query/s]
Downloading: 100%|██████████| 1739/1739 [00:01<00:00, 1676.51rows/s]

         school             grade  year  total
0     AKINS H S          grade_10  2020    720
1     AKINS H S          grade_10  2021    747
2     AKINS H S          grade_11  2020    664
3     AKINS H S          grade_11  2021    663
4     AKINS H S          grade_12  2020    609
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021     69
1735  ZILKER EL      kindergarten  2020     77
1736  ZILKER EL      kindergarten  2021     63
1737  ZILKER EL  pre_kindergarten  2020     30
1738  ZILKER EL  pre_kindergarten  2021     13

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 4 homework marker. Start homework from here.

Count the number of asian students enrolled in Louisiana by school, grade, and year

In [20]:
%%bigquery
select school, grade, year, sum(safe_cast(asian as float64)) as asian_student_total
from school_enrollments.la
where school != "" and asian != ""
group by school, grade, year
having asian_student_total > 0.0
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1522.99query/s]
Downloading: 100%|██████████| 2889/2889 [00:01<00:00, 2716.10rows/s]

                                school        grade  year  asian_student_total
0       A. A. Nelson Elementary School  pk_12_total  2019                223.0
1       A. A. Nelson Elementary School  pk_12_total  2020                207.0
2       A. A. Nelson Elementary School  pk_12_total  2021                164.0
3     A. E. Phillips Laboratory School  pk_12_total  2019                 14.0
4     A. E. Phillips Laboratory School  pk_12_total  2020                 20.0
...                                ...          ...   ...                  ...
2884               Zachary High School  pk_12_total  2020                 34.0
2885               Zachary High School  pk_12_total  2021                 33.0
2886          Zwolle Elementary School  pk_12_total  2019                  2.0
2887          Zwolle Elementary School  pk_12_total  2020                  2.0
2888          Zwolle Elementary School  pk_12_total  2021                  2.0

[2889 rows x 4 columns]

In [60]:
!bq --location=US mk --dataset "views1"

Dataset 'vaulted-dolphin-339503:views1' successfully created.

In [61]:
%%bigquery
create view views1.asian_student_enrollments_by_school_grade_year as
select school, grade, year, sum(safe_cast(asian as float64)) as asian_student_total
from school_enrollments.la
where school != "" and asian != ""
group by school, grade, year
having asian_student_total > 0.0
order by school, grade, year

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1321.87query/s]

Empty DataFrame
Columns: []
Index: []

In [63]:
%%bigquery
select * from views1.asian_student_enrollments_by_school_grade_year

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1939.71query/s]
Downloading: 100%|██████████| 2889/2889 [00:01<00:00, 2150.73rows/s]

                                school        grade  year  asian_student_total
0       A. A. Nelson Elementary School  pk_12_total  2019                223.0
1       A. A. Nelson Elementary School  pk_12_total  2020                207.0
2       A. A. Nelson Elementary School  pk_12_total  2021                164.0
3     A. E. Phillips Laboratory School  pk_12_total  2019                 14.0
4     A. E. Phillips Laboratory School  pk_12_total  2020                 20.0
...                                ...          ...   ...                  ...
2884               Zachary High School  pk_12_total  2020                 34.0
2885               Zachary High School  pk_12_total  2021                 33.0
2886          Zwolle Elementary School  pk_12_total  2019                  2.0
2887          Zwolle Elementary School  pk_12_total  2020                  2.0
2888          Zwolle Elementary School  pk_12_total  2021                  2.0

[2889 rows x 4 columns]

Count the number of schools in each public school district of Minnesota, ordered from largest to smallest

In [45]:
%%bigquery
select count(school) as school_count, lower(district) as district
from school_enrollments.mn 
where district like '%Public%'
group by district
order by school_count desc

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1908.53query/s]
Downloading: 100%|██████████| 281/281 [00:01<00:00, 268.87rows/s]

     school_count                               district
0            2811     minneapolis public school district
1            2052  anoka-hennepin public school district
2            1651        st. paul public school district
3             710       rochester public school district
4             625           osseo public school district
..            ...                                    ...
276            31      frazee-vergas public school dist.
277            31    buffalo lk-hector-stewart public sc
278            27      browns valley public school dist.
279            16      blackduck public school district
280            15            perz public school district

[281 rows x 2 columns]

Find the avg amount of each race of students in California's 'El Tejon Unified' district

In [141]:
%%bigquery
select school, avg(white) as avg_white, avg(black) as avg_black, avg(hispanic) as avg_hispanic, avg(asian) as avg_asian 
from school_enrollments.ca
where district = 'El Tejon Unified' and school != ''
group by school
order by avg_white, avg_black, avg_hispanic, avg_asian

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1105.51query/s]
Downloading: 100%|██████████| 4/4 [00:01<00:00,  3.50rows/s]

,school,avg_white,avg_black,avg_hispanic,avg_asian
0,"Nonpublic, Nonsectarian Schools",0.000000,0.000000,0.000000,0.142857
1,El Tejon Elementary,10.928571,0.000000,13.071429,0.214286
2,Frazier Mountain High,17.857143,0.285714,16.214286,0.714286
3,Frazier Park Elementary,21.857143,0.285714,16.714286,0.214286

Count number of male and female students in 12th grade for each school, combine records of both Nevada and Oklahoma

In [142]:
%%bigquery 
select school, sum(safe_cast(male as float64)) as male_total, sum(safe_cast(female as float64)) as female_total
from school_enrollments.ok where grade = 'grade_12' and male is not null and female is not null and school != '' group by school
UNION ALL select school, sum(safe_cast(male as float64)) as male_total, sum(safe_cast(female as float64)) as female_total
from school_enrollments.nv where grade = 'grade_12' and male is not null and female is not null and school != ''
group by school
having count(school) > 0
order by female_total, male_total desc

Query complete after 0.00s: 100%|██████████| 4/4 [00:00<00:00, 2421.30query/s]
Downloading: 100%|██████████| 1185/1185 [00:01<00:00, 1131.51rows/s]

                             school  male_total  female_total
0     OYA CHARTER TECUMSEH 9TH-12TH        42.0           0.0
1                  Summit View JSHS        17.0           0.0
2      OYA CHARTER MANITOU 9TH-12TH        13.0           0.0
3                   Independence HS        12.0           0.0
4                   Spring Mtn JSHS        11.0           0.0
...                             ...         ...           ...
1180                      OWASSO HS      1405.0        1403.0
1181                       JENKS HS      1584.0        1630.0
1182                       UNION HS      2191.0        2169.0
1183                BROKEN ARROW HS      2577.0        2470.0
1184     EPIC ONE ON ONE CHARTER HS      1807.0        2754.0

[1185 rows x 3 columns]

Average number of white, black and hispanic students enrolled between 2019 - 2021 in King County Washington, grouped by district

In [ ]:
!bq --location=US mk --dataset "views2"

In [152]:
%%bigquery
select district, avg(white) as white_avg, avg(black) as black_avg, avg(hispanic) as avg_hispanic, year
from school_enrollments.wa
where county = 'King' and year between 2019 and 2021
group by district, year
order by district, year desc

Query complete after 0.00s: 100%|██████████| 3/3 [00:00<00:00, 1821.50query/s]
Downloading: 100%|██████████| 82/82 [00:01<00:00, 64.49rows/s]

                         district   white_avg  black_avg  avg_hispanic  year
0        Ashe Preparatory Academy    0.000000  28.400000      2.800000  2020
1          Auburn School District  123.431694  30.513661    117.836066  2021
2          Auburn School District  150.023392  32.912281    128.327485  2020
3          Auburn School District  147.977143  30.217143    122.948571  2019
4        Bellevue School District  110.687225  11.541850     46.555066  2021
..                            ...         ...        ...           ...   ...
77        Tukwila School District   23.389831  43.796610     60.610169  2020
78        Tukwila School District   25.898305  42.033898     59.322034  2019
79  Vashon Island School District   87.692308   0.461538     15.461538  2021
80  Vashon Island School District   88.923077   0.384615     15.538462  2020
81  Vashon Island School District   92.769231   0.384615     15.538462  2019

[82 rows x 5 columns]

Sum of distinct number of elementary, middle, and high schools in New Hampshire districts in 2021

In [132]:
%%bigquery
select count(distinct(school)) as num_instances, ccd_district_lvl, district 
from school_enrollments.nh
where ccd_district_lvl in('Elementary', 'Middle', 'High') and year = 2021
group by district, ccd_district_lvl
order by count(distinct(school)) desc;

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 1045.96query/s]
Downloading: 100%|██████████| 126/126 [00:00<00:00, 135.17rows/s]

,num_instances,ccd_district_lvl,district
0,1,Elementary,Allenstown
1,1,Elementary,Alton
2,1,Elementary,Amherst
3,1,Elementary,Andover
4,1,Elementary,Ashland
...,...,...,...
121,1,Elementary,Gate City Charter School For the Arts
122,1,Elementary,MicroSociety Academy Charter School Foundation
123,1,High,Prospect Mountain JMA
124,1,High,Coe-Brown Northwood Academy
125,1,High,Pinkerton Academy

Average total number of students enrolled per district in k-12 schools in Alaska in 2020 by descending order

In [148]:
%%bigquery
SELECT avg(total) as avg_total, district
FROM `vaulted-dolphin-339503.school_enrollments.ak` 
WHERE grade = 'k_12_total' and year = 2020
GROUP BY district
HAVING sum(total) > 100 
ORDER BY avg(total) desc, district;

Query complete after 0.00s: 100%|██████████| 1/1 [00:00<00:00, 930.00query/s]
Downloading: 100%|██████████| 51/51 [00:00<00:00, 67.01rows/s]

      avg_total                              district
0   2062.000000                   Galena City Schools
1    940.666667                   Nenana City Schools
2    922.816327                     Anchorage Schools
3    796.416667                Mat-Su Borough Schools
4    691.526316  Fairbanks North Star Borough Schools
5    570.250000                Juneau Borough Schools
6    439.600000     Ketchikan Gateway Borough Schools
7    431.000000                       Mount Edgecumbe
8    400.883721       Kenai Peninsula Borough Schools
9    384.000000                Denali Borough Schools
10   352.857143                 Sitka Borough Schools
11   351.636364                   Lower Yukon Schools
12   351.454545                 Yukon-Koyukuk Schools
13   344.000000         Kodiak Island Borough Schools
14   324.000000           North Slope Borough Schools
15   302.000000                   Kashunamiut Schools
16   292.666667               Dillingham City Schools
17   284.800000                   Nome Public Schools
18   279.103448               Lower Kuskokwim Schools
19   278.714286      Northwest Arctic Borough Schools
20   274.666667                 Unalaska City Schools
21   274.400000                   Valdez City Schools
22   260.333333                  Delta/Greely Schools
23   235.000000            Petersburg Borough Schools
24   231.500000                        Yupiit Schools
25   225.600000                    Craig City Schools
26   214.625000                 Bering Strait Schools
27   191.200000                       Chugach Schools
28   182.000000                  Saint Mary's Schools
29   162.500000                  Cordova City Schools
30   154.000000                 Wrangell City Schools
31   151.666667                  Copper River Schools
32   143.500000                Annette Island Schools
33   138.500000                Haines Borough Schools
34   129.555556              Southwest Region Schools
35   126.000000                  Klawock City Schools
36   125.000000                       Skagway Schools
37   124.000000                   Hoonah City Schools
38   101.000000                     Kake City Schools
39    87.600000        Aleutians East Borough Schools
40    86.444444                Alaska Gateway Schools
41    73.600000                        Kuspuk Schools
42    70.000000                 Iditarod Area Schools
43    67.333333                  Yakutat City Schools
44    66.666667                 Hydaburg City Schools
45    60.800000                       Chatham Schools
46    60.000000                   Yukon Flats Schools
47    55.500000           Bristol Bay Borough Schools
48    44.428571    Lake and Peninsula Borough Schools
49    43.333333                      Pribilof Schools
50    37.111111              Southeast Island Schools